Repository: 84000/translation-memory-resources
Catalog: post_input/toh101.bo.en.tmx
Source language: bo
Languages: en

source: བཅོམ་ལྡན་འདས་ བཅོམ་ལྡན་འདས་ དེ་བཞིན་ གཤེགས་པ་ དགྲ་བཅོམ་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ སངས་རྒྱས་ ཤཱཀྱ་ ཐུབ་པ་ སངས་རྒྱས་ ཀྱི་ ཞིང་ འཇིག་རྟེན་ གྱི་ ཁམས་ མི་མཇེད་ དེར་ བདག་ མཆི་བ ར་ བགྱི འོ །_།
en: $861 “Blessed One,” |#| “I wish to travel to that world of Enduring, the buddha realm of the thus-gone one, the worthy one, the perfect buddha Śākyamuni.”

source: ང འི་ ཚིག་ གིས་ གནོད་པ་ ཆུང་ ངམ །_ ཉམ་ང་བ་ ཉུང་ ངམ །_ བསྐྱོད་པ་ ཡང་ ངམ །_ སྟོབས་ དང་ བདེ་བ ར་ རེག་པ་ ལ་ གནས་ སམ་ ཞེས་ སྙུན་ ཡང་ གསོལ་ ཅིག _།
en: Ask that blessed one on my behalf whether he has encountered but little hardship or discomfort, and whether he remains healthy, strong, and at ease.”

source: དེ་ནས་ བྱང་ཆུབ་ སེམས་དཔའ་ དེ་ བཅོམ་ ལྡན་འདས་ དེ འི་ ཞབས་ ལ་ ཕྱག་ འཚལ་ ཏེ །_ |#| བསྐོར་བ་ ཡང་ བྱས་ ནས་ སོང་ སྟེ །_
en: $863 The bodhisattva then bowed his head to the feet of that blessed one and circumambulated him.

source: དེ་ འདི་ལྟ་སྟེ་ དཔེར་ན་ སྐྱེས་བུ་ སྟོབས་ དང་ ལྡན་པ་ ཞིག་ གིས་ ལག་པ་ བསྐུམ་པ་ རྐྱོང་བ ར་ བྱེད་པ འམ །_ བརྐྱང་བ་ སྐུམ་པ ར་ བྱེད་པ འི་ སྐད་ཅིག་ དང་ །_ ཐང་ ཅིག་ དང་ །_ ཡུད་ཙམ་ དེས་ འཇིག་རྟེན་ གྱི་ ཁམས་ དེ་ནས་ མི་སྣང་བ ར་ གྱུར་ ནས་ |#| འཇིག་རྟེན་ གྱི་ ཁམས་ མི་མཇེད་ འདིར་ འདུག་ སྟེ
en: Then, as fast as an athlete can stretch out or bend an arm, he disappeared from that universe and arrived at once, in one instant and in one moment, in the world of Enduring.

source: དེ་ བཅོམ་ལྡན་འདས་ དེ་བཞིན་ གཤེགས་པ་ ཤཱཀྱ་ ཐུབ་པ་ ག་ལ་བ་ དེར་ སོང་ སྟེ་ ཕྱིན་ ནས །_ |#| བཅོམ་ལྡན་འདས་ དེ འི་ ཞབས་ ལ་ ཕྱག་ འཚལ་ ཏེ་ ཕྱོགས་ གཅིག་ ཏུ་ འདུག་ གོ །_། |#| ཕྱོགས་ གཅིག་ ཏུ་ [105a] འདུག་ ནས་ ཀྱང་ བཅོམ་ལྡན་འདས་ ལ་ འདི་སྐད་ ཅེས་ གསོལ་ ཏོ །_།
en: There he proceeded to the place where the blessed Śākyamuni was residing, bowed his head to his feet in homage, [105.a] then sat to one side and said,

source: བཅོམ་ལྡན་འདས་ བཅོམ་ལྡན་འདས་ ལ་ གནོད་པ་ ཆུང་ ངམ །_ ཉམ་ང་བ་ ཉུང་ ངམ །_ བསྐྱོད་པ་ ཡང་ ངམ །_ སྟོབས་ དང་ བདེ་བ ར་ རེག་པ་ ལ་ གནས་ སམ་ ཞེས་ དེ་བཞིན་ གཤེགས་པ་ དོན་ཡོད་ མིང་ སྒྲོགས་ སྙུན་ གསོལ་ ལགས་སོ །_།
en: “Blessed One, the blessed Propagator of the Meaningful Name inquires whether you have encountered but little hardship or discomfort, and whether you remain healthy, strong, and at ease.”

source: དེ འི་ ཚེ་ བྱང་ཕྱོགས་ ནས་ བཅོམ་ལྡན་འདས་ དེ་བཞིན་ གཤེགས་པ་ དོན་ཡོད་ མིང་ སྒྲོགས་ ལ་སོགས་ ཏེ །_ |#| བཅོམ་ལྡན་འདས་ དོན་ཡོད་ རྣམ་པར་ གནོན་ གྱི་ སངས་རྒྱས་ ཀྱི་ ཞིང་ དང་ །_ དེ་བཞིན་ དུ་ དོན་ཡོད་ ཁྱུ་མཆོག་ དང་ །_ དོན་ཡོད་ འོད་ཟེར་ དང་ །_ བརྩོན་འགྲུས་ མཐའ་ ཡ ས་ དང་ །_ སཱ་ལ འི་ དབང་པོ འི་ རྒྱལ་པོ་ དང་ །_ བརྩོན་པ་ མཐའ་ ཡ ས་ དང་ །_ སཱ་ལ་ རིན་པོ་ཆེ་ དང་ །_ གདུགས་ གཅིག་པ་ དང་ །_ རྒྱུ་སྐར་ བཀོད་པ་ དང་ །_ དཀོན་མཆོག་ འབྱུང་གནས་ དང་ །_ ཙན་དན་ ཁང་པ་ དང་ །_ ཙན་དན་ སྤོས་ ཀྱི་ འོད་ དང་ །_ འོད་ མཐའ་ ཡ ས་ དང་ །_ འོད་ ཀྱི་ དཀྱིལ་ འཁོར་ ཅན་ དང་ །_ ལྷུན་པོ་ རྣམ་དག་ དང་ །_ ཐོགས་པ་ མེད་པ འི་ སྤྱན་ དང་ །_ སྤྱན་ མཐའ་ ཡ ས་ དང་ །_ རིན་ཆེན་ འབྱུང་ དང་ །_ ཀུན་ གྱི་ དཔལ་ དང་ །_ སངས་རྒྱས་ མེ་ཏོག་ འབྱུང་བ འི་ དཔལ་ དང་ །_ བློ་གྲོས་ རབ་གནས་ དང་ །_ མཐའ་ ཡ ས་ རྣམ་པར་ གནོན་ དང་ །_ དོན་ཡོད་ དཔལ་ དང་ །_ རིན་ཆེན་ རྣམ་པར་ གནོན་ དང་ །_ གོ་ཆ་ མཐའ་ ཡ ས་ དང་ །_ བཀོད་པ་ མཐའ་ ཡ ས་ དང་ །_ ནམ་མཁ འི་ དཀྱིལ་འཁོར་ འོད་ཟེར་ དང་ །_ མཚན་མ་ མེད་པ འི་ ང་རོ་ དང་ །_ རྩི འི་ རྒྱལ་པོ་ དང་ །_ བག་ཚ་བ་ མི་ མངའ་བ་ དང་ །_ སྤུ་ ཟིང་ ཞེས་ བྱེད་པ འི་ འཇིགས་ བྲལ་ དང་ །_ ཡོན་ཏན་ རྒྱལ་པོ འི་ འོད་ དང་ །_ སྤྱན་རས་ གཟིགས་ ཀྱི་ བློ་ སྒྲུབ་ མེ་ཏོག་ དང་ །_ ནམ་མཁ འི་ རིགས་ དང་ །_ ནམ་མཁ འི་ ང་རོ་ དང་ །_ ནམ་མཁའ་ བཀོད་པ འི་ ང་རོ་ དང་ །_ དེ་བཞིན་ གཤེགས་པ་ དེ་དག་ དང་ །_ གཞན་དག་ གིས་ སངས་རྒྱས་ ཀྱི་ ཞིང་ དག་ ནས་ |#| བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ སྐྱེ་ [105b] བ་ གཅིག་ གིས་ ཐོགས་པ་ དག་ འཇིག་རྟེན་ གྱི་ ཁམས་ མི་མཇེད་ ག་ལ་བ་ དང་ །_ བཅོམ་ལྡན་འདས་ ག་ལ་བ་ དེར་ ལྷགས་ ཏེ་
en: $865 In this way there arrived from the north innumerably and unfathomably many bodhisattva great beings, all held back by just a single birth. |#| They came from the buddha realm of the blessed thus-gone Propagator of the Meaningful Name, the buddha realm of the blessed Meaningful Subduer, and the buddha realms of blessed ones such as Meaningful Leader, Meaningful Light Rays, Anantavīrya, King of Sal Trees, Infinite Endeavor, Jewel of Sal Trees , Single Parasol, Array of Heavenly Bodies, Ratnākara, Sandalwood Mansion, Light of Sandalwood Incense, Anantaprabha, Jālinīprabha , Mountain of Purity, Unhindered Eyes, Infinite Eyes, Ratnasaṃbhava, Glory of All, Splendorous Source of Buddha Flowers, Susthitamati, Anantavikrāmin, Meaningful Glory, Subjugating Jewel, Infinite Armor, Infinite Array , Light Rays of the Space Sphere, Roar of Signlessness, Nectar King, Niśaṅka, He Whose Body Hairs Never Rise in Fear , Guṇarājaprabha, Flower of Accomplishing Avalokiteśvara’s Mind, Sky Family, Sky Roar, and Roar of the Arrays of Space. [105.b] Arriving in the world of Enduring, they proceeded to the Kalandaka­nivāpa in the Veṇuvana by Rājagṛha and the place where the Blessed One was residing.

source: ལྷགས་ ནས་ ཀྱང་ བཅོམ་ལྡན་འདས་ ཀྱི་ ཞབས་ ལ་ ཕྱག་ འཚལ་ ཏེ་ |#| ཕྱོགས་ གཅིག་ ཏུ་ འཁོད་ དོ །_།
en: There they bowed their heads to the Blessed One’s feet and sat to one side.

source: དེ འི་ ཚེ་ འོག་ གི་ ཕྱོགས་ སུ་ འཇིག་རྟེན་ གྱི་ ཁམས་ གྲངས་མེད་ དཔག་ ཏུ་ མེད་པ་ དག་ འདས་པ་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ ནམ་མཁ འི་ དཀྱིལ་འཁོར་ རྣམ་པར་ དག་ ཅེས་བྱ་བ་ ཡོད་ དེ །_
en: $866 At that time there was in the direction below, beyond innumerable and unfathomable universes, a universe known as Perfectly Pure Sphere of Space .

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ སྤྱན་ ཆེན་པོ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Great Eye.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རིམ་པ འི་ བུ་ ཞེས་ བྱ་ བ་ བླ་ ན་ མེད་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ བྱང་ཆུབ་ ཏུ་ ལུང་བསྟན་ ཏོ །_།
en: This blessed one had prophesied that a bodhisattva known as Hereditary Son would awaken to unsurpassable and perfect buddhahood.

source: དེ་ནས་ བྱང་ཆུབ་ སེམས་དཔའ་ རིམ་པ འི་ བུས་ སྣང་བ་ ཆེན་པོ་ དེ་ མཐོང་ སྟེ །_ |#| གསུང་ བསལ་བ འི་ སྒྲ་ དེ་ཡང་ ཐོས་ སོ །_།
en: That bodhisattva Hereditary Son had also noticed the great light and heard the sound of the clear voice.

source: ཐོས་ ནས་ ཀྱང་ བཅོམ་ལྡན་འདས་ དེ་ ལ་ འདི་སྐད་ ཅེས་ གསོལ་ ཏོ །_།
en: He therefore went before the blessed Great Eye and asked,

source: བཅོམ་ལྡན་འདས་ འོད་ ཀྱི་ སྣང་བ་ ཀུན་ དུ་ གདའ་བ་ དེ་ དང་ །_ གསུང་ བསལ་བ འི་ སྒྲ་ གྲག་པ་ དེ་ སུ འི་ ལགས །_
en: “Blessed One, to whom belongs this pervasive light and clear voice?”

source: རིགས་ ཀྱི་ བུ་ སྟེང་ གི་ ཕྱོགས་ སུ་ འཇིག་རྟེན་ གྱི་ ཁམས་ གྲངས་མེད་ དཔག་ ཏུ་ མེད་པ་ དག་ འདས་པ་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ མི་མཇེད་ ཅེས་བྱ་བ་ ཡོད་ དེ
en: $867 “Noble son,” |#| “above this buddha realm, beyond innumerable and unfathomable universes, lies a universe known as Enduring.

source: དེ་བཞིན་ གཤེགས་པ་ དེ་ ནི་ ད་ལྟ ར་ བྱང་ཆུབ་ སེམས་དཔ འི་ སྡེ་སྣོད་ སེམས་ཅན་ ཐམས་ཅད་ ཡང་དག་ པར་ ཚིམ་པ ར་ བྱེད་པ་ སེམས་ཅན་ ཐམས་ཅད་ ཀྱི་ ཐེ་ཚོམ་ གཅོད་པ ར་ བྱེད་པ་ ཞེས་ བྱ་བ འི་ ཆོས་ ཀྱི་ རྣམ་ གྲངས་ ཡང་དག་ པར་ རབ་ཏུ་ སྟོན་ ཏེ
en: That thus-gone one is now delivering a Dharma teaching that belongs to the Bodhisattva Collection and is known as ‘Truly Satisfying All Sentient Beings by Eliminating Their Doubts.’

source: འཁོར་ དེ་ ན་ ཡང་ བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ གོ་ཆ་ ཆེན་པོ་ བགོས་པ་ དཔེ་མེད་པ་ སེམས་པ་ དག་ ཆོས་ བསྟན་པ་ དེ་ ཉན་པ ར་ བྱེད་ དེ །_
en: Bodhisattva great beings who have donned the great armor and possess an incomparable intent have gathered in his retinue so that they may listen to his Dharma teaching.

source: དེ་དག་ གི་ མིང་ བརྗོད་པ་ ཙམ་ གྱིས་ སེམས་ཅན་ རྣམས་ བླ་ ན་ མེད་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ བྱང་ཆུབ་ ཏུ་ ངེས་པ ར་ འགྱུར་ རོ །_།
en: Merely pronouncing their names will destine sentient beings to unexcelled and perfect awakening.”

source: བཅོམ་ལྡན་འདས་ དེ་ ལ་ བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ རིམ་པ འི་ བུས་ འདི་སྐད་ ཅེས་ [106a] གསོལ་ ཏོ །_།
en: said the bodhisattva great being Hereditary Son, [106.a]

source: བཅོམ་ལྡན་འདས་ ཤཱཀྱ་ ཐུབ་པ་ དེ་ ལ་ བལྟ་བ་ དང་ །_ ཕྱག་ བགྱི་བ་ དང་ །_ བསྙེན་བཀུར་ བགྱི་བ འི་ སླད་ དུ་ འཇིག་རྟེན་ གྱི་ ཁམས་ མི་མཇེད་ དེར་ བདག་ མཆི་བ ར་ བགྱི འོ །_།
en: $868 “Blessed One,” |#| “I wish to go to that world of Enduring so that I may see, venerate, and serve the blessed thus-gone Śākyamuni.”

source: དེ་ནས་ བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ རིམ་པ འི་ བུ་ བཅོམ་ལྡན་འདས་ དེ འི་ ཞབས་ ལ་ ཕྱག་ འཚལ་ ཏེ །_
en: $870 Then the bodhisattva great being Hereditary Son bowed his head to the feet of that blessed one and,

source: འདི་ལྟ་སྟེ་ དཔེར་ན །_ སྐྱེས་བུ་ སྟོབས་ དང་ ལྡན་པ་ ཞིག་ གིས་ ལག་པ་ བསྐུམ་པ་ རྐྱོང་བ ར་ བྱེད་པ འམ །_ བརྐྱང་བ་ སྐུམ་པ ར་ བྱེད་པ འི་ སྐད་ཅིག་ དེས་ འཇིག་རྟེན་ གྱི་ ཁམས་ དེ་ནས་ མི་སྣང་བ ར་ གྱུར་ ནས་ |#| དེ་ འཇིག་རྟེན་ གྱི་ ཁམས་ མི་མཇེད་ འདིར་ འདུག་ སྟེ
en: as fast as an athlete can stretch out or bend an arm, he disappeared from that universe and instantly emerged here in the world of Enduring.

source: དེ་ རྒྱལ་པོ འི་ ཁབ་ འོད་མ འི་ ཚལ་ བྱ་ ཀ་ ལན་ ད་ ཀ་ གནས་པ་ ག་ལ་བ་ དང་ །_ བཅོམ་ལྡན་འདས་ ག་ལ་བ་ དེར་ སོང་ སྟེ་ ཕྱིན་ ནས །_ |#| བཅོམ་ལྡན་འདས་ ལ་ འདི་སྐད་ ཅེས་ གསོལ་ ཏོ །_།
en: Arriving at the Kalandaka­nivāpa in the Veṇuvana by Rājagṛha, he proceeded to the place where the Blessed One was residing and said,

source: བཅོམ་ལྡན་འདས་ བཅོམ་ལྡན་འདས་ ལ་ གནོད་པ་ ཆུང་ ངམ །_ ཉམ་ང་བ་ ཉུང་ ངམ །_ བསྐྱོད་པ་ ཡང་ ངམ །_ སྟོབས་ དང་ བདེ་བ ར་ རེག་པ་ ལ་ གནས་ སམ་ ཞེས་ དེ་བཞིན་ གཤེགས་པ་ སྤྱན་ ཆེན་པོ་ སྙུན་ གསོལ་ ལགས་སོ །_།
en: “Blessed One, the thus-gone Great Eye inquires whether you have encountered but little hardship or discomfort, and whether you remain healthy, strong, and at ease.”

source: དེ་ནས་ བཅོམ་ལྡན་འདས་ ཀྱིས་ བྱང་ཆུབ་ སེམས་དཔའ་ རིམ་པ འི་ བུ་ ལ་ འདི་སྐད་ ཅེས་ བཀའ་ སྩལ་ ཏོ །_།
en: asked the Blessed One in return,

source: རིགས་ ཀྱི་ བུ་ ཅི་ སངས་རྒྱས་ ཀྱི་ ཞིང་ དེ་ ན་ བཅོམ་ ལྡན་འདས་ དེ་ གནོད་པ་ ཆུང་ ངམ །_ སྙུན་ མི་ མངའ་ འམ །_ བདེ་བ ར་ རེག་པ་ ལ་ གནས་ སམ །_
en: $871 Noble son,” |#| “is that blessed one free from harm and distress in his buddha realm, and is he happy?”

source: དེ་ལྟ ར་ དེ་བཞིན་ གཤེགས་པ་ སྤྱན་ ཆེན་པོ་ ལ་སོགས་ ཏེ །_ |#| བཅོམ་ལྡན་འདས་ དེ་བཞིན་ གཤེགས་པ་ མཆོག་ གི་ དཔལ་ གྱི་ སངས་རྒྱས་ ཀྱི་ ཞིང་ དང་ དེ་བཞིན་ དུ་ དེ་བཞིན་ གཤེགས་པ་ པད་མ འི་ དཔལ་ འབྱུང་ དང་ །_ སེང་གེ འི་ དཔལ་ དང་ །_ དོན་གྲུབ་ དང་ །_ དཔལ་ སྦས་ དང་ །_ སེང་གེ འི་ འགྲམ་པ་ དང་ །_ ཤིན་ཏུ་ རབ་ཏུ་ གནས་པ འི་ རྒྱལ་པོ་ དང་ །_ ཚངས་པ་ ལྷུན་པོ་ དང་ །_ སྤྱན་ རྣམ་པར་ དག་པ་ [106b] དང་ །_ དོན་ཡོད་པ འི་ གོམ་པ ས་ རྣམ་པར་ གནོན་ དང་ །_ སྤོས་ ཀྱི་ གླང་པོ་ཆེ་ དང་ །_ སྤོས་ ཀྱི་ དཔལ་ དང་ །_ སྤོས་ ཀྱི་ ལྷུན་པོ་ དང་ །_ སྤྱན་ ཚད་ མེད་པ་ དང་ །_ སྤོས་ བརྩེགས་ དང་ །_ རིན་ཆེན་ ལྷུན་པོ་ དང་ །_ ཤིན་ཏུ་ རབ་གནས་ དང་ །_ ཤིན་ཏུ་ རབ་ཏུ་ གནས་པ འི་ རྒྱལ་པོ་ དང་ །_ སཱ་ལ འི་ དབང་པོ འི་ རྒྱལ་པོ་ དང་ །_ འོད་ ཀྱི་ དཀྱིལ་འཁོར་ འཛིན་ དང་ །_ མེ་སྒྲོན་ དང་ །_ སྐར་མདའ་ སྒྲོན་མ་ དང་ །_ བརྩོན་འགྲུས་ དོན་ཡོད་ དང་ །_ ཤིན་ཏུ་ ཡང་དག་ བརྟགས་ ཀྱི་ གོ་ཆ་ དང་ །_ སེང་གེ་ དང་ །_ སེམས་ཅན་ གྱི་ ཁ་ལོ་ སྒྱུར་བ་ དང་ །_ རབ་མཆོག་ རབ་ཏུ་ གནས་པ འི་ རྒྱལ་པོ འི་ སངས་རྒྱས་ ཀྱི་ ཞིང་ དང་ །_ དེ་བཞིན་ གཤེགས་པ་ དགྲ་བཅོམ་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ སངས་རྒྱས་ དེ་ ལ་སོགས་པ་ གྲངས་མེད་ དཔག་ ཏུ་ མེད་པ་ དག་ གི་ སངས་རྒྱས་ ཀྱི་ ཞིང་ དག་ ནས་ |#| བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ སྐྱེ་བ་ གཅིག་ གིས་ ཐོགས་པ་ གྲངས་མེད་ དཔག་ ཏུ་ མེད་པ་ དག་ འཇིག་རྟེན་ གྱི་ ཁམས་ མི་མཇེད་ ག་ལ་བ་ དང་ །_ བཅོམ་ལྡན་འདས་ ག་ལ་བ་ དེར་ དོང་ སྟེ་ |#| ལྷགས་ ནས །_
en: $872 In this way arrived innumerably and unfathomably many bodhisattva great beings, all held back by just a single birth. |#| They came from the buddha realms of thus-gone ones, worthy ones, perfect buddhas such as Great Eye, Supreme Splendor, Source of Lotus Splendor, Lion Glory , Siddhārtha, Śrīgupta, Lion Jaws, Supra­tiṣṭhita­rāja, Brahmā Mountain, Viśuddhanetra, [106.b] Amogha­pada­vikrāmin, Gandhahastī, Incense Splendor, Incense Mountain, Limitless Eyes, Gandhakūṭa, Jewel Mountain, Supratiṣṭhita , Supra­tiṣṭhita­rāja, King of Sal Trees, Holder of the Luminous Sphere, Ulkā, Ulkāpradīpa, Armor of Perfect Analysis, Siṃha, Leader of Beings, and King of Supreme Stable Presence. |#| $873 Arriving in the world of Enduring from such innumerable and unfathomable buddha realms, they proceeded to the Kalandaka­nivāpa in the Veṇuvana by Rājagṛha and the place where the Blessed One was residing.

source: བཅོམ་ལྡན་འདས་ ཀྱི་ ཞབས་ ལ་ ཕྱག་ འཚལ་ ཏེ་ ཕྱོགས་ གཅིག་ ཏུ་ འཁོད་ དོ །།_།།
en: There they bowed their heads to the Blessed One’s feet and sat to one side.

source: དེ འི་ ཚེ་ སྟེང་ གི་ ཕྱོགས་ སུ་ འཇིག་རྟེན་ གྱི་ ཁམས་ གྲངས་མེད་ དཔག་ ཏུ་ མེད་པ་ དག་ འདས་པ་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ ཙན་དན་ སྤོས་ ཀྱི་ འོད་ ཅེས་བྱ་བ་ ཡོད་ དེ །_
en: $874 At that time there was in the direction above, beyond innumerable and unfathomable universes, a universe known as Light of Sandalwood Incense .

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ ཡུལ་ མཐའ་ཡས་པ ར་ མངོན་པར་ འཕགས་པ འི་ རྒྱལ་པོ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Superior King of the Infinite Field.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ ང་རོ་ དཔག་ ཏུ་ མེད་ ཅེས་བྱ་བ་ བླ་ ན་ མེད་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ བྱང་ཆུབ་ ཏུ་ ལུང་བསྟན་ ཏོ །_།
en: This blessed one had prophesied that a bodhisattva known as Unfathomable Roar would awaken to unsurpassable and perfect buddhahood.

source: དེ་ནས་ བྱང་ཆུབ་ སེམས་དཔའ་ ང་རོ་ དཔག་ ཏུ་ མེད་ ཀྱིས་ སྣང་བ་ ཆེན་པོ་ དེ་ མཐོང་ ཞིང་ གསུང་ བསལ་བ འི་ སྒྲ་ དེ་ཡང་ ཐོས་ ནས །_
en: That bodhisattva Unfathomable Roar had also noticed the great light and heard the sound of the clear voice.

source: དེ་ བཅོམ་ལྡན་འདས་ དེ་བཞིན་ གཤེགས་པ་ ཡུལ་ མཐའ་ཡས་པ ར་ མངོན་དུ་ འཕགས་པ འི་ རྒྱལ་པོ་ ག་ལ་བ་ དེར་ སོང་ སྟེ །_ |#| ཕྱིན་ ནས་ |#| བཅོམ་ལྡན་འདས་ དེ འི་ ཞབས་ ལ་མགོ་ བོས་ ཕྱག་ འཚལ་ ཏེ་
en: He therefore went before the thus-gone Superior King of the Infinite Field, and bowed his head to that blessed one’s feet.

source: བཅོམ་ལྡན་འདས་ འོད་ གདའ་ [107a] བ་ དེ་ དང་ གསུང་ བསལ་བ འི་ སྒྲ་ གྲག་པ་ དེ་ སུ འི་ ལགས །_
en: “Blessed One, [107.a] to whom belongs this pervasive light and clear voice?”

source: རིགས་ ཀྱི་ བུ་ འོག་ གི་ ཕྱོགས་ སུ་ འཇིག་རྟེན་ གྱི་ ཁམས་ གྲངས་མེད་ དཔག་ ཏུ་ མེད་པ་ དག་ འདས་པ་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ མི་མཇེད་ ཅེས་བྱ་བ་ ཡོད་ དེ
en: $875 “Noble son,” |#| “below this buddha realm, beyond innumerable and unfathomable universes, lies a universe known as Enduring.

source: འཁོར་ དེར་ ཡང་ ཆོས་ མཉན་པ འི་ ཕྱིར །_ བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ དཔེ་མེད་པ་ སེམས་པ་ དག་ འདུས་པ ར་ གྱུར་ ཏེ་ འཁོད་ དོ །_།
en: In his retinue have arrived bodhisattva great beings of incomparable intent who wish to listen to the Dharma.”

source: བཅོམ་ལྡན་འདས་ བཅོམ་ ལྡན་འདས་ དེ་བཞིན་ གཤེགས་པ་ དགྲ་བཅོམ་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ སངས་རྒྱས་ ཤཱཀྱ་ ཐུབ་པ་ དེ འི་ ཐད་ དུ་ འཇིག་རྟེན་ གྱི་ ཁམས་ མི་མཇེད་ དེར་ བདག་ མཆི་བ ར་ བགྱི འོ །_།
en: $876 “Blessed One,” |#| “I wish to travel to that world of Enduring, the buddha realm of the thus-gone one, the worthy one, the perfect buddha Śākyamuni.”

source: དེ་ནས་ བྱང་ཆུབ་ སེམས་དཔའ་ ང་རོ་ དཔག་ ཏུ་ མེད་པ ས་ བཅོམ་ལྡན་འདས་ དེ འི་ ཞབས་ ལ་ ཕྱག་ འཚལ་ ཏེ་ བཅོམ་ལྡན་འདས་ དེ་ ལ་ བསྐོར་ བ་ བྱས་ ནས་ སོང་ སྟེ །_
en: $878 The bodhisattva then bowed his head to the feet of that blessed one and circumambulated him.

source: འདི་ལྟ་སྟེ་ དཔེར་ན་ སྐྱེས་བུ་ སྟོབས་ དང་ ལྡན་པ་ ཞིག་ གིས་ ལག་པ་ བསྐུམ་པ་ རྐྱོང་བ ར་ བྱེད་པ འམ །_ བརྐྱང་བ་ སྐུམ་པ ར་ བྱེད་པ འི་ སྐད་ཅིག་ དེས་ སངས་རྒྱས་ ཀྱི་ ཞིང་ དེ་ནས་ མི་སྣང་བ ར་ གྱུར་ ནས །_ |#| འཇིག་རྟེན་ གྱི་ ཁམས་ མི་མཇེད་ འདིར་ འདུག་ སྟེ །_
en: Then, as fast as an athlete can stretch out or bend an arm, he disappeared from that universe and arrived at once in the world of Enduring.

source: དེ་ རྒྱལ་ པོ འི་ ཁབ་ འོད་མ འི་ ཚལ་ བྱ་ ཀ་ ལན་ ད་ ཀ་ གནས་པ་ ག་ལ་བ་ དང་ །_ བཅོམ་ལྡན་འདས་ ག་ལ་བ་ དེར་ སོང་ སྟེ་ ཕྱིན་ ནས །_ |#| བཅོམ་ལྡན་འདས་ ཀྱི་ ཞབས་ ལ་ ཕྱག་ འཚལ་ ཏེ་ ཕྱོགས་ གཅིག་ ཏུ་ འདུག་ གོ །_། |#| ཕྱོགས་ གཅིག་ ཏུ་ འདུག་ ནས་ ཀྱང་ བཅོམ་ལྡན་འདས་ ལ་ འདི་སྐད་ ཅེས་ གསོལ་ ཏོ །_།
en: There he proceeded to the Kalandaka­nivāpa in the Veṇuvana by Rājagṛha and the place where the blessed Śākyamuni was residing, bowed his head to his feet in homage, sat to one side, and said,

source: བཅོམ་ལྡན་འདས་ བཅོམ་ལྡན་འདས་ ལ་ གནོད་པ་ ཆུང་ ངམ །_ ཉམ་ང་བ་ ཉུང་ ངམ །_ བསྐྱོད་པ་ ཡང་ ངམ །_ སྟོབས་ དང་ བདེ་བ ར་ རེག་པ་ ལ་ གནས་ སམ་ ཞེས་ དེ་བཞིན་ གཤེགས་པ་ ཡུལ་ མཐའ་ཡས་པ ར་ མངོན་དུ་ འཕགས་པ འི་ རྒྱལ་པོ་ སྙུན་ གསོལ་ ལགས་སོ །_།
en: “Blessed One, the blessed Superior King of the Infinite Field inquires whether you have encountered but little hardship or discomfort, and whether you remain healthy, strong, and at ease.” [107.b]

source: དེ་ནས་ [107b] བཅོམ་ལྡན་འདས་ ཀྱིས་ དེ་ ལ་ བཀའ་ སྩལ་པ །_
en: replied the Blessed One,

source: རིགས་ ཀྱི་ བུ་ ཅི་ བཅོམ་ལྡན་འདས་ དེ་ སྙུན་ མི་ མངའ་ འམ །_ སྟོབས་ དང་ ལྡན་ ནམ །_ འགྱུར་བ་ མི་ མངའ་ འམ །_
en: $879 “Noble son,” |#| “is that blessed one free from harm, is he strong, and does he remain unchanged?”

source: བཅོམ་ལྡན་འདས་ དེ་ལྟ ར་ ལགས་སོ །_།
en: “Yes, indeed, Blessed One,”

source: དེ་ལྟ ར་ དེ་བཞིན་ གཤེགས་པ་ ཡུལ་ མཐའ་ཡས་པ ར་ མངོན་དུ་ འཕགས་པ འི་ རྒྱལ་པོ་ ལ་སོགས་པ་ བཅོམ་ལྡན་འདས་ དེ་བཞིན་ གཤེགས་པ་ བརྩོན་འགྲུས་ མངོན་དུ་ འཕགས་པ འི་ རྒྱལ་པོ འི་ སངས་རྒྱས་ ཀྱི་ ཞིང་ དང་ །_ དེ་བཞིན་ དུ་ དེ་བཞིན་ གཤེགས་པ་ ཡིད་གཉིས་ ཡང་དག་ འཇོམས་ དང་ །_ རྒྱུ་སྐར་ བཟང་པོ འི་ རྒྱལ་པོ་ དང་ །_ ཉིན་ མཛད་ དང་ །_ འོད་ མཛད་ དང་ །_ ལྷུན་པོ་ འོད་ དང་ །_ འོད་ ཀྱི་ དཀྱིལ་འཁོར་ དང་ །_ རྣམ་པར་ དག་པ འི་ འོད་ དང་ །_ ཟས་ ཀྱི་ གདུགས་ དང་ །_ སྤོས་ ཀྱི་ གདུགས་ དང་ །_ རིན་ཆེན་ གདུགས་ དང་ །_ ཙན་དན་ གྱི་ ཁང་པ་ དང་ །_ དགའ་བ འི་ དཔལ་ དང་ །_ རི་རབ་ ཕུང་པོ་ དང་ །_ རིན་པོ་ཆེ འི་ འོད་ དང་ །_ སཱ་ལ འི་ དབང་པོ འི་ རྒྱལ་པོ་ དང་ །_ ཚངས་པ འི་ དཔལ་ དང་ །_ རྣམ་པར་ དག་པ འི་ སྤྱན་ དང་ །_ བག་ཚ་བ་ མི་ མངའ་བ་ དང་ །_ སྤུ་ ཟིང་ ཞེས་ བྱེད་པ འི་ འཇིགས་པ་ དང་ བྲལ་བ་ དང་ །_ རིན་ཆེན་ གོ་ཆ་ མཐའ་ ཡ ས་ དང་ །_ བླ་ ན་ |#| མེད་པ འི་ འོད་ཟེར་ དང་ །_ དེ་བཞིན་ གཤེགས་པ་ དྲ་བ་ ཅན་ གྱི་ འོད་ ཀྱི་ ཏོག་ དང་ །_ དེ་བཞིན་ གཤེགས་པ་ རྒྱུ འི་ རྒྱལ་པོ འི་ སངས་རྒྱས་ ཀྱི་ ཞིང་ དང་ །_ སངས་རྒྱས་ བཅོམ་ལྡན་འདས་ དེ་དག་ ལ་སོགས་པ་ གྲངས་མེད་ དཔག་ ཏུ་ མེད་པ་ དག་ གི་ སངས་རྒྱས་ ཀྱི་ ཞིང་ དག་ ནས་ |#| བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ གྲངས་མེད་ དཔག་ ཏུ་ མེད་པ་ དག་ འཇིག་རྟེན་ གྱི་ ཁམས་ མི་མཇེད་ ག་ལ་བ་ དང་ །_ རྒྱལ་པོ འི་ ཁབ་ འོད་མ འི་ ཚལ་ བྱ་ ཀ་ ལན་ ད་ ཀ་ གནས་པ་ ག་ལ་བ་ དང་ །_ བཅོམ་ལྡན་འདས་ ག་ལ་བ་ དེར་ སོང་ སྟེ
en: $880 In this way there arrived innumerably and unfathomably many bodhisattva great beings, all held back by just a single birth. |#| They came from the buddha realm of the thus-gone Superior King of the Infinite Field, the buddha realm of the blessed thus-gone King of Superior Diligence, and the buddha realms of other blessed ones such as Conqueror of All Doubt, Sunakṣatra, Divākara, Prabhaṅkara, Mountain of Light, Prabhāmaṇḍala, Pure Light , Parasol of Nourishment, Parasol of Incense, Ratnacchatra, Sandalwood Mansion, Śrīharṣa, Meruskandha, Ratnaprabha, King of Sal Trees, Brahmā Glory, Viśuddhanetra, Niśaṅka, He Whose Body Hairs Never Rise in Fear, Infinite Jewel Armor , Unsurpassable Light Rays, the thus-gone Light Net Crest, and the thus-gone King of Causes. |#| Arriving in the world of Enduring, they proceeded to the Kalandaka­nivāpa in the Veṇuvana by Rājagṛha and the place where the Blessed One was residing.

source: ཕྱིན་ ནས་ བཅོམ་ལྡན་འདས་ ཀྱི་ ཞབས་ ལ་ ཕྱག་ འཚལ་ ཏེ་ ཕྱོགས་ གཅིག་ ཏུ་ འཁོད་ དོ །_།
en: There they bowed their heads to the Blessed One’s feet and sat to one side.

source: དེ འི་ ཚེ་ ཤར་ལྷོ འི་ ཕྱོགས་མཚམས་ སུ་ འཇིག་རྟེན་ གྱི་ ཁམས་ གྲངས་མེད་ དཔག་ ཏུ་ མེད་པ་ དག་ འདས་པ་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ སངས་རྒྱས་ པད་མ འི་ མེ་ཏོག་ འབྱུང་བ འི་ དཔལ་ ཞེས་ བྱ་བ་ ཡོད་ དེ
en: $881 At that time there was in the southeast, beyond innumerable and unfathomable universes, a universe known as Splendid Source of Buddha Lotuses.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ སངས་རྒྱས་ ཐམས་ཅད་ ཀྱི་ སྐུ་ ཀུན་ ཏུ་ སྟོན་པ འི་ དཔལ་ ཞེས་ བྱ་བ་ བཞུགས་ [108a] ཏེ་
en: There resided the thus-gone Splendid Display of the Body of All the Buddhas. [108.a]

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ མྱ་ངན་ བྲལ་ ཞེས་ བྱ་བ་ བླ་ ན་ མེད་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ བྱང་ཆུབ་ ཏུ་ ལུང་བསྟན་ ཏོ །_།
en: This blessed one had prophesied that a bodhisattva known as Vigataśoka would awaken to unsurpassable and perfect buddhahood.

source: དེ་ནས་ བྱང་ཆུབ་ སེམས་དཔའ་ མྱ་ངན་ བྲལ་ གྱིས་ སྣང་བ་ ཆེན་པོ་ དེ་ མཐོང་ ཞིང་ གསུང་ བསལ་བ འི་ སྒྲ་ དེ་ཡང་ ཐོས་ སོ །_།
en: That bodhisattva had also noticed the great light and heard the sound of the clear voice.

source: ཐོས་ ནས་ ཀྱང་ བཅོམ་ལྡན་འདས་ དེ་བཞིན་ གཤེགས་པ་ སངས་རྒྱས་ ཐམས་ཅད་ ཀྱི་ སྐུ་ ཀུན་ ཏུ་ སྟོན་པ འི་ དཔལ་ དེ་ག་ ལ་བ་ དེར་ སོང་ སྟེ །_ |#| བཅོམ་ལྡན་འདས་ དེ འི་ ཞབས་ ལ་ ཕྱག་ འཚལ་ ནས་ བཅོམ་ལྡན་འདས་ དེ་ ལ་ འདི་སྐད་ ཅེས་ གསོལ་ ཏོ །_།
en: He therefore went before the thus-gone Splendid Display of the Body of All the Buddhas, prostrated to him, and asked,

source: བཅོམ་ལྡན་འདས་ འོད་ གདའ་བ་ དེ་ དང་ །_ གསུང་ བསལ་བ འི་ སྒྲ་ གྲག་པ་ དེ་ སུ འི་ ལགས །_
en: “Blessed One, whose is this light and clear voice?”

source: རིགས་ ཀྱི་ བུ་ ནུབ་བྱང་ གི་ ཕྱོགས་མཚམས་ སུ་ འཇིག་རྟེན་ གྱི་ ཁམས་ གྲངས་མེད་ དཔག་ ཏུ་ མེད་པ་ དག་ འདས་པ་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ མི་མཇེད་ ཅེས་བྱ་བ་ ཡོད་ དེ
en: $882 “Noble son,” |#| “in the northwest, beyond innumerable and unfathomable universes, lies a universe known as Enduring.

source: འདི་ལྟ་སྟེ་ བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ བསམ་ གྱིས་ མི་ ཁྱབ་ ཅིང་ དཔེ་མེད་པ འི་ གོ་ཆ་ བགོས་པ་ རྣམས་ ལ་ བྱང་ཆུབ་ སེམས་དཔ འི་ སྡེ་སྣོད་ ཅེས་བྱ་བ འི་ ཆོས་ ཀྱི་ རྣམ་ གྲངས་ ཡང་དག་ པར་ རབ་ཏུ་ སྟོན་ ཏོ །_།
en: Presently he is delivering the Dharma teaching known as the Bodhisattva Collection to a gathering of bodhisattva great beings who bear an inconceivable and incomparable armor.”

source: བཅོམ་ལྡན་འདས་ བཅོམ་ལྡན་འདས་ ཤཱཀྱ་ ཐུབ་པ་ དེ་ ལ་ བལྟ་བ་ དང་ །_ ཕྱག་ བགྱི་བ་ དང་ །_ བསྙེན་བཀུར་ བགྱི་བ འི་ སླད་ དུ་ འཇིག་རྟེན་ གྱི་ ཁམས་ མི་མཇེད་ དེར་ བདག་ མཆི་བ ར་ བགྱི འོ །_།
en: $883 “Blessed One,” |#| “I wish to travel to that world of Enduring so that I may see, venerate, and serve the blessed thus-gone Śākyamuni.”

source: བཅོམ་ ལྡན་འདས་ དེས་ བཀའ་ སྩལ་པ །_
en: replied the Blessed One,

source: དེ་ནས་ བྱང་ཆུབ་ སེམས་ དཔའ་ མྱ་ངན་ བྲལ་ བཅོམ་ལྡན་འདས་ དེ་ ལ་ ཕྱག་ འཚལ་ ནས་ སོང་ སྟེ །_ |#| འདི་ལྟ་སྟེ་ དཔེར་ན་ སྐྱེས་བུ་ སྟོབས་ དང་ ལྡན་པ་ ཞིག་ གིས་ ལག་པ་ བསྐུམ་པ་ རྐྱོང་བ ར་ བྱེད་པ འམ །_ བརྐྱང་བ་ སྐུམ་པ ར་ བྱེད་པ འི་ སྐད་ཅིག་ དེས་ འཇིག་རྟེན་ གྱི་ ཁམས་ མི་མཇེད་ འདིར་ འོངས་ ཏེ །_
en: $885 The bodhisattva Vigataśoka then bowed his head to the feet of that blessed one, and as fast as an athlete can stretch out or bend an arm, he arrived in an instant here in the world of Enduring. [108.b]

source: དེ་ བཅོམ་ལྡན་ [108b] འདས་ དེ་བཞིན་ གཤེགས་པ་ ཤཱཀྱ་ ཐུབ་པ་ ག་ལ་བ་ དེར་ སོང་ ནས །_ |#| བཅོམ་ལྡན་འདས་ ཀྱི་ ཞབས་ ལ་ ཕྱག་ འཚལ་ ཏེ་ ཕྱོགས་ གཅིག་ ཏུ་ འདུག་ གོ །_།
en: There he proceeded to the place where the blessed Śākyamuni was residing, prostrated, and sat to one side.

source: བཅོམ་ལྡན་འདས་ བཅོམ་ལྡན་འདས་ ལ་ གནོད་པ་ ཆུང་ ངམ །_ ཉམ་ང་བ་ ཉུང་ ངམ །_ བསྐྱོད་པ་ ཡང་ ངམ །_ སྟོབས་ དང་ བདེ་བ ར་ རེག་པ་ ལ་ གནས་ སམ་ ཞེས་ དེ་བཞིན་ གཤེགས་པ་ སངས་རྒྱས་ ཐམས་ཅད་ ཀྱི་ སྐུ་ ཀུན་ ཏུ་ སྟོན་པ འི་ དཔལ་ སྙུན་ གསོལ་ ལགས་སོ །_།
en: “Blessed One, the blessed Splendid Display of the Body of All the Buddhas inquires whether you have encountered but little hardship or discomfort, and whether you remain healthy, strong, and at ease.”

source: རིགས་ ཀྱི་ བུ་ ཅི་ བཅོམ་ལྡན་འདས་ དེ་ སྙུན་ མི་ མངའའམ །_ སྟོབས་ དང་ ལྡན་ ནམ །_ འགྱུར་བ་ མི་ མངའའམ །_
en: $886 “Noble son,” |#| “is that blessed one free from harm, is he strong, and does he remain unchanged?”
